Feature: Управление на задача

	Background:
		Given Разработчикът отваря екран за управление на задачите

  Scenario: Създаване на нова задача
    When Въвежда име на задачата "ExampleName"
    And Въвежда описание на задачата "ExampleDescription"
    And Назначава задачата към даден проект
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение "Задачата е успешно създадена! Статус: Нова"
    
  Scenario: Създаване на нова задача без въведено име
    When Въвежда описание на задачата "ExampleDescription"
    And Назначава задачата към даден проект
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение "Непълни данни!"
    
  Scenario: Създаване на нова задача без въведено описание
    When Въвежда име на задачата "ExampleName"
    And Назначава задачата към даден проект
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение "Непълни данни!"
    
  Scenario: Създаване на нова задача без назначаване на задачата към проект
    When Въвежда име на задачата "ExampleName"
    And Въвежда описание на задачата "ExampleDescription"
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение "Непълни данни!"
    
  Scenario: Започване на работа върху задача без да е назначен разработчик към нея
    Given Задачата е създадена
    When Не е назначен разработчик към нея
    And Натисне бутона за започване на работа
    Then Вижда съобщение "Задачата не е пусната в процес на разработка, защото не е назначен работник към нея!"
    
  Scenario: Започване на работа върху задача с назначен разработчик към нея
    Given Задачата е създадена
    Given Назначаване на разработчик към задачата
    When Има назначен разработчик към нея
    And Натисне бутона за започване на работа
    Then Вижда съобщение "Задачата е успешно пусната в процес на разработка! Статус: В процес на разработка"
       
  Scenario: Отказване на задача
    Given Задачата е създадена
    When Натисне бутона за отказване на задача
    Then Вижда съобщение "Задачата е успешно отказана! Статус: Отказана"
    
  Scenario: Завършване на задача
    Given Задачата е създадена
    When Натисне бутона за завършване на задача
    Then Вижда съобщение "Задачата е успешно завършена! Статус: Завършена"
    
  Scenario: Започване на работа върху задача, която е завършена
    Given Задачата е създадена
    Given Назначаване на разработчик към задачата
    Given Задачата е завършена
    When Има назначен разработчик към нея
    And Натисне бутона за започване на работа
    Then Вижда съобщение "Задачата е завършена и нейният статус не може да бъде променян!"
    
  Scenario: Отказване на задача, която е завършена
    Given Задачата е създадена
    Given Задачата е завършена
    When Натисне бутона за отказване на задача
    Then Вижда съобщение "Задачата е завършена и нейният статус не може да бъде променян!"
    
    
  
  
  
    
  
    
    
