Feature: Управление на задача

  Scenario: Създаване на нова задача
    Given Разработчикът отваря екран за управление на задачите
    When Въвежда име на задачата
    And Въвежда описание на задачата
    And Назначава задачата към даден проект
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение за успешно създадена нова задача
    
  Scenario: Създаване на нова задача без въведено име
    Given Разработчикът отваря екран за управление на задачите
    When Въвежда описание на задачата
    And Назначава задачата към даден проект
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение за непълни данни
    
  Scenario: Създаване на нова задача без въведено описание
    Given Разработчикът отваря екран за управление на задачите
    When Въвежда име на задачата
    And Назначава задачата към даден проект
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение за непълни данни
    
  Scenario: Създаване на нова задача без назначаване на задачата към проект
    Given Разработчикът отваря екран за управление на задачите
    When Въвежда име на задачата
    And Въвежда описание на задачата
    And Натисне бутона за създаване на нова задача
    Then Вижда съобщение за непълни данни
    
  Scenario: Започване на работа върху задача без да е назначен разработчик към нея
    Given Разработчикът отваря екран за управление на задачите
    Given Задачата е създадена
    When Не е назначен разработчик към нея
    And Натисне бутона за започване на работа
    Then Вижда съобщение за грешка, поради липса на назначен работник
    
  Scenario: Започване на работа върху задача с назначен разработчик към нея
    Given Разработчикът отваря екран за управление на задачите
    Given Задачата е създадена
    Given Назначаване на разработчик към задачата
    When Има назначен разработчик към нея
    And Натисне бутона за започване на работа
    Then Вижда съобщение за успешно започване на работа върху задачата
  
    
  
    
    
